{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "PeftModel",
    "parent_library": "peft.peft_model"
  },
  "base_model_name_or_path": "RefalMachine/ruadapt_qwen2.5_3B_ext_u48_instruct_v4",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "o_proj",
    "q_proj",
    "v_proj",
    "k_proj"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}