{
  "</tool_call>": 147090,
  "<tool_call>": 147089,
  "<|box_end|>": 147081,
  "<|box_start|>": 147080,
  "<|endoftext|>": 147075,
  "<|file_sep|>": 147096,
  "<|fim_middle|>": 147092,
  "<|fim_pad|>": 147094,
  "<|fim_prefix|>": 147091,
  "<|fim_suffix|>": 147093,
  "<|im_end|>": 147077,
  "<|im_start|>": 147076,
  "<|image_pad|>": 147087,
  "<|object_ref_end|>": 147079,
  "<|object_ref_start|>": 147078,
  "<|quad_end|>": 147083,
  "<|quad_start|>": 147082,
  "<|repo_name|>": 147095,
  "<|video_pad|>": 147088,
  "<|vision_end|>": 147085,
  "<|vision_pad|>": 147086,
  "<|vision_start|>": 147084
}
